##### Reading   OBE Marksheet

Evaluation ID, Student_Enrollment, Assessments ID, Obtain Marks

In [1]:
import pandas as pd
file = pd.read_excel('CSE216 OBE Mark Sheet.xlsx')

In [2]:
file.head()

,Serial,ID,Course ID,Section,Semester,Midterm,Unnamed: 6,Unnamed: 7,Unnamed: 8,Unnamed: 9,...,Final Total,Final Total Converted,Project Work,Project Work Total,Total,Unnamed: 22,CO Total,Unnamed: 24,Unnamed: 25,Unnamed: 26
0,NaN,NaN,NaN,NaN,NaN,CO1,CO1,CO1,CO2,CO1,...,100.0,40.0,CO4,30.0,100.0,NaN,CO1,CO2,CO3,CO4
1,NaN,NaN,NaN,NaN,NaN,Q1,Q2,Q3,Q4,Q5,...,NaN,NaN,Lab,NaN,NaN,NaN,165,35,50,30
2,NaN,NaN,NaN,NaN,NaN,25,25,30,20,30,...,NaN,NaN,30,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,1.0,1416455.0,CSE216,1.0,Summer,15,0,5,15,2,...,65.0,26.0,24,24.0,67.0,8.2,55,26,28,24
4,2.0,1579288.0,CSE216,1.0,Summer,0,0,18,0,5,...,46.0,18.4,23,23.0,57.0,8.6,45,13,23,23

In [3]:
file.tail()

,Serial,ID,Course ID,Section,Semester,Midterm,Unnamed: 6,Unnamed: 7,Unnamed: 8,Unnamed: 9,...,Final Total,Final Total Converted,Project Work,Project Work Total,Total,Unnamed: 22,CO Total,Unnamed: 24,Unnamed: 25,Unnamed: 26
86,84.0,1868128.0,CSE216,1.0,Summer,15,15,24,15,4,...,69.0,27.6,27,27.0,81.0,8.8,104,26,27,27
87,85.0,1845457.0,CSE216,1.0,Summer,0,0,20,0,0,...,0.0,0.0,0,0.0,12.0,8.0,20,0,0,0
88,86.0,1855787.0,CSE216,2.0,Summer,20,15,26,10,0,...,51.0,20.4,23,23.0,66.0,8.4,83,24,15,23
89,87.0,1893863.0,CSE216,2.0,Summer,0,0,20,6,0,...,0.0,0.0,0,0.0,14.0,8.8,20,6,0,0
90,88.0,1842333.0,CSE216,2.0,Summer,20,0,15,14,6,...,52.0,20.8,25,25.0,65.0,8.2,67,25,15,25

##### Evaluation For Midterm Questions

In [4]:
# Taking columns for Q1
mid_q1 = file.iloc[3:, :6]
mid_q1.head()

   Serial         ID Course ID  Section  Semester Midterm
3     1.0  1416455.0    CSE216       1.0   Summer      15
4     2.0  1579288.0    CSE216       1.0   Summer       0
5     3.0  1528882.0    CSE216       3.0   Summer      15
6     4.0  1653725.0    CSE216       3.0   Summer       0
7     5.0  1625654.0    CSE216       1.0   Summer       5

In [5]:
# Dropping 2 columns as we needed 4 columns 
q1 = mid_q1.drop(mid_q1.columns[[2,3]], axis= 1)
q1.head()

   Serial         ID Semester Midterm
3     1.0  1416455.0   Summer      15
4     2.0  1579288.0   Summer       0
5     3.0  1528882.0   Summer      15
6     4.0  1653725.0   Summer       0
7     5.0  1625654.0   Summer       5

In [9]:
# Cnverting q1 as a list
midterm_q1_l = q1.values.tolist()
print(midterm_q1_l[1])

[2.0, 1579288.0, 'Summer', 0]

In [10]:
# To get question no. for assessments ID
to_list = file.values.tolist()
question_no = to_list[1:][0][5]
print("Question number is: ",question_no)

Question number is:  Q1

In [11]:
print(midterm_q1_l[3])

[4.0, 1653725.0, 'Summer', 0]

In [12]:
for i in range(len(midterm_q1_l)):
    midterm_q1_l[i][0] = 30000 + i
    midterm_q1_l[i][1] = 300 + i
    midterm_q1_l[i][2] = 'CSE216_Mid_' + question_no   # As our assessments ID named like this
    
print(midterm_q1_l[1])

[30001, 301, 'CSE216_Mid_Q1', 0]

In [13]:
# Converting list dataframe
df = pd.DataFrame(midterm_q1_l,columns=['Evaluation ID', 'Student_Enrollment', 'Assessments ID', 'Obtain Marks'] )
df.head()

   Evaluation ID  Student_Enrollment Assessments ID  Obtain Marks
0          30000                 300  CSE216_Mid_Q1            15
1          30001                 301  CSE216_Mid_Q1             0
2          30002                 302  CSE216_Mid_Q1            15
3          30003                 303  CSE216_Mid_Q1             0
4          30004                 304  CSE216_Mid_Q1             5

In [14]:
df.to_excel('evaluation_for_cse216_mid_q1.xlsx')

Evaluation for question 2

In [15]:
# Taking columns for Q2
mid_q2 = file.iloc[3:, :7]
mid_q2.head()

   Serial         ID Course ID  Section  Semester Midterm Unnamed: 6
3     1.0  1416455.0    CSE216       1.0   Summer      15          0
4     2.0  1579288.0    CSE216       1.0   Summer       0          0
5     3.0  1528882.0    CSE216       3.0   Summer      15          7
6     4.0  1653725.0    CSE216       3.0   Summer       0          0
7     5.0  1625654.0    CSE216       1.0   Summer       5         15

In [16]:
# Dropping 3 columns as we needed 4 columns 
q2 = mid_q2.drop(mid_q2.columns[[2,3,4]], axis= 1)
q2.head()

   Serial         ID Midterm Unnamed: 6
3     1.0  1416455.0      15          0
4     2.0  1579288.0       0          0
5     3.0  1528882.0      15          7
6     4.0  1653725.0       0          0
7     5.0  1625654.0       5         15

In [17]:
# Cnverting q2 as a list
midterm_q2_l = q2.values.tolist()
print(midterm_q2_l[1])

[2.0, 1579288.0, 0, 0]

In [18]:
# To get question no. for assessments ID
to_list = file.values.tolist()
question_no = to_list[1:][0][6]         # can be write as funtion
print("Question number is: ",question_no)

Question number is:  Q2

In [19]:
for i in range(len(midterm_q2_l)):
    midterm_q2_l[i][0] = 31000 + i
    midterm_q2_l[i][1] = 300 + i
    midterm_q2_l[i][2] = 'CSE216_Mid_' + question_no   # As our assessments ID named like this
    
print(midterm_q2_l[13])

[31013, 313, 'CSE216_Mid_Q2', 0]

In [20]:
# Converting list dataframe
df = pd.DataFrame(midterm_q2_l,columns=['Evaluation ID', 'Student_Enrollment', 'Assessments ID', 'Obtain Marks'] )
df.head()

   Evaluation ID  Student_Enrollment Assessments ID  Obtain Marks
0          31000                 300  CSE216_Mid_Q2             0
1          31001                 301  CSE216_Mid_Q2             0
2          31002                 302  CSE216_Mid_Q2             7
3          31003                 303  CSE216_Mid_Q2             0
4          31004                 304  CSE216_Mid_Q2            15

In [21]:
df.to_excel('evaluation_for_cse216_mid_q2.xlsx')

Evaluation for question 3

In [22]:
# Taking columns for Q3
mid_q3 = file.iloc[3:, :8]
mid_q3.head()

,Serial,ID,Course ID,Section,Semester,Midterm,Unnamed: 6,Unnamed: 7
3,1.0,1416455.0,CSE216,1.0,Summer,15,0,5
4,2.0,1579288.0,CSE216,1.0,Summer,0,0,18
5,3.0,1528882.0,CSE216,3.0,Summer,15,7,0
6,4.0,1653725.0,CSE216,3.0,Summer,0,0,0
7,5.0,1625654.0,CSE216,1.0,Summer,5,15,20

In [23]:
# Dropping 4 columns as we needed 4 columns 
q3 = mid_q3.drop(mid_q3.columns[[2,3,4,5]], axis= 1)
q3.head()

   Serial         ID Unnamed: 6 Unnamed: 7
3     1.0  1416455.0          0          5
4     2.0  1579288.0          0         18
5     3.0  1528882.0          7          0
6     4.0  1653725.0          0          0
7     5.0  1625654.0         15         20

In [24]:
# Function to get question number

def get_question_no(file, column_number):
    to_list = file.values.tolist()                      # file is the full data which we loaded first
    question_no = to_list[1:][0][column_number]         # can be write as funtion
    print("Question number is: ",question_no)
    return question_no

In [25]:
mid_question_3 = get_question_no(file, 7)   # q3 is on column 7
print(mid_question_3)
#print(type(mid_question_3))

Question number is:  Q3
Q3

In [26]:
# Function to modify column values for evaluation

def modify(eval_id, evaluate_data, question_no, exam):
    evaluate_data_l = evaluate_data.values.tolist()
    #print("Before: ", evaluate_data_l[0])
    for i in range(len(evaluate_data_l)):
        evaluate_data_l[i][0] = eval_id + i
        evaluate_data_l[i][1] = 300 + i
        evaluate_data_l[i][2] = exam + question_no   # As our assessments ID named like this
    #print('After: ', evaluate_data_l[0])
    #return evaluate_data_l
    df = pd.DataFrame(evaluate_data_l,columns=['Evaluation ID', 'Student_Enrollment', 'Assessments ID', 'Obtain Marks'] )
    return df

In [27]:
question_3 = modify(32000, q3, mid_question_3, 'CSE216_Mid_')
#print(question_3[1])

In [28]:
question_3.head()

   Evaluation ID  Student_Enrollment Assessments ID  Obtain Marks
0          32000                 300  CSE216_Mid_Q3             5
1          32001                 301  CSE216_Mid_Q3            18
2          32002                 302  CSE216_Mid_Q3             0
3          32003                 303  CSE216_Mid_Q3             0
4          32004                 304  CSE216_Mid_Q3            20

In [29]:
# Saving as Excel sheet
question_3.to_excel('evaluation_for_cse216_mid_q3.xlsx')

Evaluation for Midterm question 4

In [30]:
# Taking columns for Q4
mid_q4 = file.iloc[3:, :9]
mid_q4.head()

,Serial,ID,Course ID,Section,Semester,Midterm,Unnamed: 6,Unnamed: 7,Unnamed: 8
3,1.0,1416455.0,CSE216,1.0,Summer,15,0,5,15
4,2.0,1579288.0,CSE216,1.0,Summer,0,0,18,0
5,3.0,1528882.0,CSE216,3.0,Summer,15,7,0,0
6,4.0,1653725.0,CSE216,3.0,Summer,0,0,0,0
7,5.0,1625654.0,CSE216,1.0,Summer,5,15,20,0

In [31]:
# Dropping 5 columns as we needed 4 columns 
q4 = mid_q4.drop(mid_q4.columns[[2,3,4,5,6]], axis= 1)
q4.head()

   Serial         ID Unnamed: 7 Unnamed: 8
3     1.0  1416455.0          5         15
4     2.0  1579288.0         18          0
5     3.0  1528882.0          0          0
6     4.0  1653725.0          0          0
7     5.0  1625654.0         20          0

In [32]:
# Getting question number
mid_question_4 = get_question_no(file, 8)   # q4 is on column 8
print(mid_question_4)

Question number is:  Q4
Q4

In [33]:
# Modify column values
question_4 = modify(33000, q4, mid_question_4, 'CSE216_Mid_')

In [34]:
# printing the modified data
question_4.head()

   Evaluation ID  Student_Enrollment Assessments ID  Obtain Marks
0          33000                 300  CSE216_Mid_Q4            15
1          33001                 301  CSE216_Mid_Q4             0
2          33002                 302  CSE216_Mid_Q4             0
3          33003                 303  CSE216_Mid_Q4             0
4          33004                 304  CSE216_Mid_Q4             0

In [35]:
# Saving as Excel sheet
question_4.to_excel('evaluation_for_cse216_mid_q4.xlsx')

Evaluation for question 5

In [36]:
# Taking columns for Q5
mid_q5 = file.iloc[3:, :10]
mid_q5.head()

,Serial,ID,Course ID,Section,Semester,Midterm,Unnamed: 6,Unnamed: 7,Unnamed: 8,Unnamed: 9
3,1.0,1416455.0,CSE216,1.0,Summer,15,0,5,15,2
4,2.0,1579288.0,CSE216,1.0,Summer,0,0,18,0,5
5,3.0,1528882.0,CSE216,3.0,Summer,15,7,0,0,0
6,4.0,1653725.0,CSE216,3.0,Summer,0,0,0,0,0
7,5.0,1625654.0,CSE216,1.0,Summer,5,15,20,0,0

In [37]:
# Dropping 6 columns as we needed 4 columns 
q5 = mid_q5.drop(mid_q5.columns[[2,3,4,5,6,7]], axis= 1)
q5.head()

   Serial         ID Unnamed: 8 Unnamed: 9
3     1.0  1416455.0         15          2
4     2.0  1579288.0          0          5
5     3.0  1528882.0          0          0
6     4.0  1653725.0          0          0
7     5.0  1625654.0          0          0

In [38]:
# Getting question number
mid_question_5 = get_question_no(file, 9)   # q5 is on column 9
print(mid_question_5)

Question number is:  Q5
Q5

In [39]:
# Modify column values
question_5 = modify(34000, q5, mid_question_5, 'CSE216_Mid_')

In [40]:
# printing the modified data
question_5.head()

   Evaluation ID  Student_Enrollment Assessments ID  Obtain Marks
0          34000                 300  CSE216_Mid_Q5             2
1          34001                 301  CSE216_Mid_Q5             5
2          34002                 302  CSE216_Mid_Q5             0
3          34003                 303  CSE216_Mid_Q5             0
4          34004                 304  CSE216_Mid_Q5             0

In [41]:
# Saving as Excel sheet
question_5.to_excel('evaluation_for_cse216_mid_q5.xlsx')

Evavulation question 6

In [42]:
# Taking columns for Q6
mid_q6 = file.iloc[3:, :11]
mid_q6.head()

,Serial,ID,Course ID,Section,Semester,Midterm,Unnamed: 6,Unnamed: 7,Unnamed: 8,Unnamed: 9,Unnamed: 10
3,1.0,1416455.0,CSE216,1.0,Summer,15,0,5,15,2,7
4,2.0,1579288.0,CSE216,1.0,Summer,0,0,18,0,5,12
5,3.0,1528882.0,CSE216,3.0,Summer,15,7,0,0,0,4
6,4.0,1653725.0,CSE216,3.0,Summer,0,0,0,0,0,0
7,5.0,1625654.0,CSE216,1.0,Summer,5,15,20,0,0,0

In [43]:
# Dropping 7 columns as we needed 4 columns 
q6 = mid_q6.drop(mid_q6.columns[[2,3,4,5,6,7,8]], axis= 1)
q6.head()

   Serial         ID Unnamed: 9 Unnamed: 10
3     1.0  1416455.0          2           7
4     2.0  1579288.0          5          12
5     3.0  1528882.0          0           4
6     4.0  1653725.0          0           0
7     5.0  1625654.0          0           0

In [44]:
# Getting question number
mid_question_6 = get_question_no(file, 10)   # q5 is on column 10
print(mid_question_6)

Question number is:  Q6
Q6

In [45]:
# Modify column values
question_6 = modify(35000, q6, mid_question_6, 'CSE216_Mid_')

In [46]:
question_6.head()

   Evaluation ID  Student_Enrollment Assessments ID  Obtain Marks
0          35000                 300  CSE216_Mid_Q6             7
1          35001                 301  CSE216_Mid_Q6            12
2          35002                 302  CSE216_Mid_Q6             4
3          35003                 303  CSE216_Mid_Q6             0
4          35004                 304  CSE216_Mid_Q6             0

In [47]:
# Saving as Excel sheet
question_6.to_excel('evaluation_for_cse216_mid_q6.xlsx')

##### Evaluation For Final Questions

In [49]:
file.head()

,Serial,ID,Course ID,Section,Semester,Midterm,Unnamed: 6,Unnamed: 7,Unnamed: 8,Unnamed: 9,...,Final Total,Final Total Converted,Project Work,Project Work Total,Total,Unnamed: 22,CO Total,Unnamed: 24,Unnamed: 25,Unnamed: 26
0,NaN,NaN,NaN,NaN,NaN,CO1,CO1,CO1,CO2,CO1,...,100.0,40.0,CO4,30.0,100.0,NaN,CO1,CO2,CO3,CO4
1,NaN,NaN,NaN,NaN,NaN,Q1,Q2,Q3,Q4,Q5,...,NaN,NaN,Lab,NaN,NaN,NaN,165,35,50,30
2,NaN,NaN,NaN,NaN,NaN,25,25,30,20,30,...,NaN,NaN,30,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,1.0,1416455.0,CSE216,1.0,Summer,15,0,5,15,2,...,65.0,26.0,24,24.0,67.0,8.2,55,26,28,24
4,2.0,1579288.0,CSE216,1.0,Summer,0,0,18,0,5,...,46.0,18.4,23,23.0,57.0,8.6,45,13,23,23

In [50]:
# Taking columns for Q6
final_index = file.iloc[0:, :14]
final_index.head()

,Serial,ID,Course ID,Section,Semester,Midterm,Unnamed: 6,Unnamed: 7,Unnamed: 8,Unnamed: 9,Unnamed: 10,Midterm Total,Midterm Total Converted,Final
0,NaN,NaN,NaN,NaN,NaN,CO1,CO1,CO1,CO2,CO1,CO1,150.0,30.0,CO1
1,NaN,NaN,NaN,NaN,NaN,Q1,Q2,Q3,Q4,Q5,Q6,NaN,NaN,Q1
2,NaN,NaN,NaN,NaN,NaN,25,25,30,20,30,20,NaN,NaN,20
3,1.0,1416455.0,CSE216,1.0,Summer,15,0,5,15,2,7,44.0,8.8,13
4,2.0,1579288.0,CSE216,1.0,Summer,0,0,18,0,5,12,35.0,7.0,NaN

In [51]:
final_index = file.iloc[0:, :18]
final_index.head()

,Serial,ID,Course ID,Section,Semester,Midterm,Unnamed: 6,Unnamed: 7,Unnamed: 8,Unnamed: 9,Unnamed: 10,Midterm Total,Midterm Total Converted,Final,Unnamed: 14,Unnamed: 15,Unnamed: 16,Final Total
0,NaN,NaN,NaN,NaN,NaN,CO1,CO1,CO1,CO2,CO1,CO1,150.0,30.0,CO1,CO1,CO2,CO3,100.0
1,NaN,NaN,NaN,NaN,NaN,Q1,Q2,Q3,Q4,Q5,Q6,NaN,NaN,Q1,Q2,Q3,Q4,NaN
2,NaN,NaN,NaN,NaN,NaN,25,25,30,20,30,20,NaN,NaN,20,15,15,50,NaN
3,1.0,1416455.0,CSE216,1.0,Summer,15,0,5,15,2,7,44.0,8.8,13,13,11,28,65.0
4,2.0,1579288.0,CSE216,1.0,Summer,0,0,18,0,5,12,35.0,7.0,NaN,10,13,23,46.0

Evaluation for final question 1

In [52]:
# Final Questions starts with column 14 and ends with 17
# Taking columns for Q1
final_q1 = file.iloc[3:, :14]
final_q1.head()

,Serial,ID,Course ID,Section,Semester,Midterm,Unnamed: 6,Unnamed: 7,Unnamed: 8,Unnamed: 9,Unnamed: 10,Midterm Total,Midterm Total Converted,Final
3,1.0,1416455.0,CSE216,1.0,Summer,15,0,5,15,2,7,44.0,8.8,13
4,2.0,1579288.0,CSE216,1.0,Summer,0,0,18,0,5,12,35.0,7.0,NaN
5,3.0,1528882.0,CSE216,3.0,Summer,15,7,0,0,0,4,26.0,5.2,2
6,4.0,1653725.0,CSE216,3.0,Summer,0,0,0,0,0,0,0.0,0.0,NaN
7,5.0,1625654.0,CSE216,1.0,Summer,5,15,20,0,0,0,40.0,8.0,8

In [53]:
# Dropping columns as we needed 4 columns 
fq1 = final_q1.drop(final_q1.columns[[2,3,4,5,6,7,8, 9, 10, 11]], axis= 1)
fq1.head()

   Serial         ID  Midterm Total Converted Final
3     1.0  1416455.0                      8.8     13
4     2.0  1579288.0                      7.0    NaN
5     3.0  1528882.0                      5.2      2
6     4.0  1653725.0                      0.0    NaN
7     5.0  1625654.0                      8.0      8

In [54]:
# Getting question number
final_question_1 = get_question_no(file, 13)   # q1 is on column 13
print(final_question_1)

Question number is:  Q1
Q1

In [55]:
# Modify column values
f_question_1 = modify(36000, fq1, final_question_1, 'CSE216_Final_')

In [56]:
f_question_1.head()

   Evaluation ID  Student_Enrollment   Assessments ID  Obtain Marks
0          36000                 300  CSE216_Final_Q1          13.0
1          36001                 301  CSE216_Final_Q1           NaN
2          36002                 302  CSE216_Final_Q1           2.0
3          36003                 303  CSE216_Final_Q1           NaN
4          36004                 304  CSE216_Final_Q1           8.0

In [57]:
# Saving as Excel sheet
f_question_1.to_excel('evaluation_for_cse216_final_q1.xlsx')

Evaluation final question 2

In [58]:
# Final Questions starts with column 14 and ends with 17
# Taking columns for Q2
final_q2 = file.iloc[3:, :15]
final_q2.head()

,Serial,ID,Course ID,Section,Semester,Midterm,Unnamed: 6,Unnamed: 7,Unnamed: 8,Unnamed: 9,Unnamed: 10,Midterm Total,Midterm Total Converted,Final,Unnamed: 14
3,1.0,1416455.0,CSE216,1.0,Summer,15,0,5,15,2,7,44.0,8.8,13,13
4,2.0,1579288.0,CSE216,1.0,Summer,0,0,18,0,5,12,35.0,7.0,NaN,10
5,3.0,1528882.0,CSE216,3.0,Summer,15,7,0,0,0,4,26.0,5.2,2,7
6,4.0,1653725.0,CSE216,3.0,Summer,0,0,0,0,0,0,0.0,0.0,NaN,NaN
7,5.0,1625654.0,CSE216,1.0,Summer,5,15,20,0,0,0,40.0,8.0,8,10

In [59]:
# Dropping columns as we needed 4 columns 
fq2 = final_q2.drop(final_q2.columns[[2,3,4,5,6,7,8, 9, 10, 11, 12]], axis= 1)
fq2.head()

   Serial         ID Final  Unnamed: 14
3     1.0  1416455.0     13          13
4     2.0  1579288.0    NaN          10
5     3.0  1528882.0      2           7
6     4.0  1653725.0    NaN         NaN
7     5.0  1625654.0      8          10

In [60]:
# Getting question number
final_question_2 = get_question_no(file, 14)   # q2 is on column 14
print(final_question_2)

Question number is:  Q2
Q2

In [61]:
# Modify column values
f_question_2 = modify(37000, fq2, final_question_2, 'CSE216_Final_')

In [62]:
f_question_2.head()

   Evaluation ID  Student_Enrollment   Assessments ID  Obtain Marks
0          37000                 300  CSE216_Final_Q2          13.0
1          37001                 301  CSE216_Final_Q2          10.0
2          37002                 302  CSE216_Final_Q2           7.0
3          37003                 303  CSE216_Final_Q2           NaN
4          37004                 304  CSE216_Final_Q2          10.0

In [63]:
# Saving as Excel sheet
f_question_2.to_excel('evaluation_for_cse216_final_q2.xlsx')

Evaluation for final question 3

In [64]:
# Final Questions starts with column 14 and ends with 17
# Taking columns for Q3
final_q3 = file.iloc[3:, :16]
final_q3.head()

,Serial,ID,Course ID,Section,Semester,Midterm,Unnamed: 6,Unnamed: 7,Unnamed: 8,Unnamed: 9,Unnamed: 10,Midterm Total,Midterm Total Converted,Final,Unnamed: 14,Unnamed: 15
3,1.0,1416455.0,CSE216,1.0,Summer,15,0,5,15,2,7,44.0,8.8,13,13,11
4,2.0,1579288.0,CSE216,1.0,Summer,0,0,18,0,5,12,35.0,7.0,NaN,10,13
5,3.0,1528882.0,CSE216,3.0,Summer,15,7,0,0,0,4,26.0,5.2,2,7,8
6,4.0,1653725.0,CSE216,3.0,Summer,0,0,0,0,0,0,0.0,0.0,NaN,NaN,NaN
7,5.0,1625654.0,CSE216,1.0,Summer,5,15,20,0,0,0,40.0,8.0,8,10,10

In [65]:
# Dropping columns as we needed 4 columns 
fq3 = final_q3.drop(final_q3.columns[[2,3,4,5,6,7,8, 9, 10, 11, 12, 13]], axis= 1)
fq3.head()

   Serial         ID Unnamed: 14 Unnamed: 15
3     1.0  1416455.0          13          11
4     2.0  1579288.0          10          13
5     3.0  1528882.0           7           8
6     4.0  1653725.0         NaN         NaN
7     5.0  1625654.0          10          10

In [66]:
# Getting question number
final_question_3 = get_question_no(file, 15)   # q3 is on column 15
print(final_question_3)

Question number is:  Q3
Q3

In [67]:
# Modify column values
f_question_3 = modify(38000, fq3, final_question_3, 'CSE216_Final_')

In [68]:
f_question_3.head()

   Evaluation ID  Student_Enrollment   Assessments ID  Obtain Marks
0          38000                 300  CSE216_Final_Q3          11.0
1          38001                 301  CSE216_Final_Q3          13.0
2          38002                 302  CSE216_Final_Q3           8.0
3          38003                 303  CSE216_Final_Q3           NaN
4          38004                 304  CSE216_Final_Q3          10.0

In [69]:
# Saving as Excel sheet
f_question_3.to_excel('evaluation_for_cse216_final_q3.xlsx')

Evaluation for question 3

In [70]:
# Final Questions starts with column 14 and ends with 17
# Taking columns for Q4
final_q4 = file.iloc[3:, :17]
final_q4.head()

,Serial,ID,Course ID,Section,Semester,Midterm,Unnamed: 6,Unnamed: 7,Unnamed: 8,Unnamed: 9,Unnamed: 10,Midterm Total,Midterm Total Converted,Final,Unnamed: 14,Unnamed: 15,Unnamed: 16
3,1.0,1416455.0,CSE216,1.0,Summer,15,0,5,15,2,7,44.0,8.8,13,13,11,28
4,2.0,1579288.0,CSE216,1.0,Summer,0,0,18,0,5,12,35.0,7.0,NaN,10,13,23
5,3.0,1528882.0,CSE216,3.0,Summer,15,7,0,0,0,4,26.0,5.2,2,7,8,13
6,4.0,1653725.0,CSE216,3.0,Summer,0,0,0,0,0,0,0.0,0.0,NaN,NaN,NaN,0
7,5.0,1625654.0,CSE216,1.0,Summer,5,15,20,0,0,0,40.0,8.0,8,10,10,4

In [71]:
# Dropping columns as we needed 4 columns 
fq4 = final_q4.drop(final_q4.columns[[2,3,4,5,6,7,8, 9, 10, 11, 12, 13, 14]], axis= 1)
fq4.head()

   Serial         ID Unnamed: 15 Unnamed: 16
3     1.0  1416455.0          11          28
4     2.0  1579288.0          13          23
5     3.0  1528882.0           8          13
6     4.0  1653725.0         NaN           0
7     5.0  1625654.0          10           4

In [72]:
# Getting question number
final_question_4 = get_question_no(file, 16)   # q4 is on column 16
print(final_question_4)

Question number is:  Q4
Q4

In [73]:
# Modify column values
f_question_4 = modify(39000, fq4, final_question_4, 'CSE216_Final_')

In [74]:
f_question_4.head()

   Evaluation ID  Student_Enrollment   Assessments ID  Obtain Marks
0          39000                 300  CSE216_Final_Q4            28
1          39001                 301  CSE216_Final_Q4            23
2          39002                 302  CSE216_Final_Q4            13
3          39003                 303  CSE216_Final_Q4             0
4          39004                 304  CSE216_Final_Q4             4

In [75]:
# Saving as Excel sheet
f_question_4.to_excel('evaluation_for_cse216_final_q4.xlsx')